% 第一组点的 x 和 y 坐标
x1 = [0.1, 0.2, 0.3, 0.4, 0.5, 0.6, 0.7, 0.8, 0.9];
y1 = [0, 1, 0, 0, 1, 0, 0, 1, 0];

% 第二组点的 x 和 y 坐标
x2 = [0, 0.1, 0.2, 0.3, 0.4, 0.5, 0.6, 0.7, 0.8, 0.9, 1];
y2 = [1, 1, 0, 1, 1, 0, 1, 1, 0, 1, 1];

% 绘制第一组点的连接线
plot(x1, y1,'LineWidth', 1.5)

hold on

% 绘制第二组点的连接线（红色粗线）
plot(x2, y2,  'LineWidth',1.5)

hold off

% 设置 x 轴和 y 轴的范围
xlim([0, 1])
ylim([0, 1])

% 设置 x 轴和 y 轴的刻度
xticks(0:0.1:1)
yticks(0:1:1)

% 添加标题和轴标签
xlabel('x')
ylabel('u(x)')
set(gca, 'FontSize', 15)